// получение абсолютного(положительного) значения числа
Math.abs(-20); // 20
Math.abs(20); // 20

// число ПИ, синус, косинус, тангенс, архтангенс
Math.sin(Math.PI / 2); // 1 , синус 90 градусов
Math.cos(Math.PI * 2); // 1 , косинус 360 градусов
Math.tan(0); //0, тангенс 0 градусов
Math.atan(0); //0, apkтангенс 0 градусов


// натуральный логорифм (ln)
Math.log(Math.E); // 1


// Округление
Math.round(3.8); // 4
Math.round(3.2); // 3
Math.round(3.5); // 4
Math.floor(3.9); // 3, округление вниз
Math.ceil(3.2); // 4, округление вверх


// Наибольшее и наименьшее число
Math.max(4, -40, 76, 43); //76
Math.min(4, -40, 76, 43); // -40

// Возведение в степень
Math.pow(10,3); //10^3; 1000
10 ** 3; // аналогичная запись но не везде поддерживается

Math.sqrt(16); // 4 квадратный корень
Math.pow(16, 0.5); // 4 ; 16^0.5
